<?php

return [

    /*
   |--------------------------------------------------------------------------
   | VPN Auto Key Configuration
   |--------------------------------------------------------------------------
   | Настройки для автоматического ключа VPN, который добавляется
   | к основным ключам подписки.
   */

    'auto_key' => [
        'enabled' => env('VPN_AUTO_KEY_ENABLED', false),
        'subdomain' => env('VPN_AUTO_KEY_SUBDOMAIN', 'auto.datasynctrue.online'),
        'name' => env('VPN_AUTO_KEY_NAME', '🌐 Ключ 1 -  Авто | Все страны'),
    ],

    /*
    |--------------------------------------------------------------------------
    | VPN Provider
    |--------------------------------------------------------------------------
    |
    | Определяет какой VPN провайдер будет использоваться в приложении.
    | Поддерживаемые значения: 'marzban', 'remnawave'
    |
    */
    'provider' => env('VPN_PROVIDER', 'marzban'),

    /*
    |--------------------------------------------------------------------------
    | Remnawave Configuration
    |--------------------------------------------------------------------------
    |
    | Настройки для Remnawave VPN провайдера
    |
    */
    'remnawave' => [
        'api_token' => env('REMNAWAVE_API_TOKEN'),
        'base_url' => env('REMNAWAVE_BASE_URL'),
    ],
];
